import React from "react";
import "./EmptyCart.scss";
import LinkButton from "../LinkButton/LinkButton";

const EmptyCart = () => {
    return (
        <div className="empty-cart">
            <div className="empty-cart-content">
                <svg
                    className="empty-cart-svg"
                    width="80"
                    height="90"
                    viewBox="0 0 80 90"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                >
                    <path
                        d="M24.8295 40.2222V16.3333C24.8295 12.5319 26.3749 8.88616 29.1257 6.19814C31.8765 3.51012 35.6074 2 39.4976 2C43.3878 2 47.1186 3.51012 49.8694 6.19814C52.6202 8.88616 54.1656 12.5319 54.1656 16.3333V40.2222M11.7799 25.8889H67.2201C68.6301 25.8887 70.0234 26.1865 71.3045 26.7618C72.5856 27.3371 73.7243 28.1763 74.6424 29.2219C75.5606 30.2675 76.2365 31.4947 76.6238 32.8195C77.0111 34.1442 77.1007 35.5351 76.8864 36.8969L70.7503 75.8453C70.2176 79.2301 68.4623 82.3167 65.8022 84.5462C63.1421 86.7758 59.753 88.001 56.2485 88H22.7467C19.243 87.9998 15.855 86.7741 13.196 84.5447C10.5369 82.3152 8.78232 79.2293 8.24975 75.8453L2.11362 36.8969C1.89932 35.5351 1.98889 34.1442 2.37621 32.8195C2.76353 31.4947 3.43942 30.2675 4.35757 29.2219C5.27571 28.1763 6.41438 27.3371 7.69551 26.7618C8.97664 26.1865 10.3699 25.8887 11.7799 25.8889Z"
                        stroke="#211D19"
                        strokeWidth="2.7"
                        strokeLinecap="round"
                        strokeLinejoin="round"
                    />
                    <path
                        d="M33.7273 63.899L33.7281 63.898C35.1776 62.2882 37.1434 61.3838 39.1932 61.3838C41.2429 61.3838 43.2088 62.2882 44.6582 63.898L44.6591 63.899M27 53C28.0035 54.0732 29.365 54.6768 30.7841 54.6768C32.2032 54.6768 33.5641 54.0738 34.5677 53.0006M43.8182 53C44.8217 54.0732 46.1832 54.6768 47.6023 54.6768C49.0214 54.6768 50.3823 54.0738 51.3859 53.0006"
                        stroke="#211D19"
                        strokeWidth="2.7"
                        strokeLinecap="round"
                        strokeLinejoin="round"
                    />
                </svg>
                <h2 className="empty-cart-heading">
                    Упс..., ваша корзина виглядає самотньо
                </h2>
                <p className="empty-cart-text">
                    Може, додати їй товарів для компанії? На сторінці{" "}
                    <strong>"Каталог"</strong> ви знайдете багато цікавих
                    варіантів.
                </p>
                <LinkButton />
            </div>
        </div>
    );
};

export default EmptyCart;
